In [2]:
import pyspark
sc = pyspark.SparkContext("local","Manipulation")
spark = pyspark.sql.SparkSession.builder.appName("Manipulation").getOrCreate()

In [8]:
from pyspark.sql.types import StructField, StructType, StringType, IntegerType

schema = StructType([StructField("Name",StringType(),True),StructField("Age",IntegerType(),True),StructField("Salary",IntegerType(),True),
        StructField("Gender",StringType(),True), StructField("City",StringType(),True)])

data = [
    ('Aljandro', 28, 13500000, 'M', 'Barranquilla'), ('Sara', 30, 4700000, 'F', 'Bogota'),('Mauricio', 35, 13000000, 'M', 'Bogota'), ('Santiago', 32, 21000000, 'M', 'Barranquilla'),
    ('Andres', 33, 10000000, 'M', 'Medellin'),  ('Jacob', 27, 7000000, 'M', 'Barranquilla'), ('Jairo', 65, 2000000, 'M', 'Bogota'), ('Carmen', 65, 1500000, 'F', 'Cali'),
    ('Sonia', 52, 4500000, 'F', 'Cali'), ('Emily', 28, 6000000, 'F', 'Barranquilla'), ('David', 35, 4000000, 'M', 'Barranquilla'), ('Sophia', 45, 7500000, 'F', 'Medellin'),
    ('Daniel', 31, 3000000, 'M', 'Medellin'), ('Olivia', 26, 5500000, 'F', 'Barranquilla'), ('Matthew', 50, 8500000, 'M', 'Bogota'), ('Emma', 33, 7000000, 'F', 'Barranquilla'),
    ('Andrew', 29, 4500000, 'M', 'Bogota'),  ('Isabella', 39, 9000000, 'F', 'Cali'), ('John', 55, 5000000, 'M', 'Barranquilla'),('Ava', 30, 6500000, 'F', 'Barranquilla'),
    ('James', 42, 8000000, 'M', 'Medellin'), ('Mia', 32, 5500000, 'F', 'Bogota'), ('Alexander', 38, 7500000, 'M', 'Cali'), ('Abigail', 27, 6000000, 'F', 'Cali'),
    ('William', 48, 8500000, 'M', 'Bogota'),  ('Charlotte', 25, 7000000, 'F', 'Cali'), ('Michael', 41, 9500000, 'M', 'Barranquilla'), ('Harper', 29, 6500000, 'F', 'Barranquilla'),
    ('Ethan', 36, 8000000, 'M', 'Cali'),  ('Evelyn', 34, 5500000, 'F', 'Barranquilla'), ('Ryan', 51, 9000000, 'M', 'Cali'),  ('Amelia', 31, 7000000, 'F', 'Medellin'),
    ('Matthew', 37, 7500000, 'M', 'Medellin'), ('Elizabeth', 23, 6000000, 'F', 'Bogota'), ('Jacob', 49, 9500000, 'M', 'Medellin'), ('Samantha', 28, 6500000, 'F', 'Cali'),
    ('Benjamin', 43, 8000000, 'M', 'Medellin'), ('Lily', 35, 5500000, 'F', 'Barranquilla'), ('Henry', 52, 9000000, 'M', 'Medellin'),('Chloe', 33, 7000000, 'F', 'Bogota'),
    ('Lucas', 40, 7500000, 'M', 'Bogota'), ('Grace', 24, 6000000, 'F', 'Medellin'), ('Gabriel', 47, 9500000, 'M', 'Cali'), ('Madison', 30, 6500000, 'F', 'Barranquilla'),
    ('Carter', 39, 8000000, 'M', 'Bogota'), ('Avery', 26, 5500000, 'F', 'Barranquilla'), ('Owen', 53, 9000000, 'M', 'Medellin'),('Victoria', 32, 7000000, 'F', 'Barranquilla'),
    ('Jackson', 44, 8500000, 'M', 'Barranquilla'), ('Penelope', 29, 6500000, 'F', 'Medellin'), ('Sebastian', 45, 9000000, 'M', 'Barranquilla'),
]
df_1 = spark.createDataFrame(
    schema = schema,
    data = data
)
df_1.show(3)

+--------+---+--------+------+------------+
|    Name|Age|  Salary|Gender|        City|
+--------+---+--------+------+------------+
|Aljandro| 28|13500000|     M|Barranquilla|
|    Sara| 30| 4700000|     F|      Bogota|
|Mauricio| 35|13000000|     M|      Bogota|
+--------+---+--------+------+------------+
only showing top 3 rows

In [13]:
from pyspark.sql.functions import col, concat, lit
#Increase the salary  10% in a new column
df_1 = df_1.withColumn("New_Salary", col("Salary") * 1.1)
df_1.show(3)
# Concatenate columns into a new Column:
df_1 = df_1.withColumn("N_Name_1", concat(col("Name"),lit(" - "),col("City")))
df_1.show(3)

+--------+---+--------+------+------------+--------------------+--------------------+
|    Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|
+--------+---+--------+------+------------+--------------------+--------------------+
|Aljandro| 28|13500000|     M|Barranquilla|1.4850000000000002E7|Aljandro - Barran...|
|    Sara| 30| 4700000|     F|      Bogota|           5170000.0|       Sara - Bogota|
|Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|
+--------+---+--------+------+------------+--------------------+--------------------+
only showing top 3 rows

+--------+---+--------+------+------------+--------------------+--------------------+
|    Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|
+--------+---+--------+------+------------+--------------------+--------------------+
|Aljandro| 28|13500000|     M|Barranquilla|1.4850000000000002E7|Aljandro - Barran...|
|    Sara| 30| 4700000|     F|      Bogota|           5170000.0|       Sara - Bogota|
|Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|
+--------+---+--------+------+------------+--------------------+--------------------+
only showing top 3 rows

In [21]:
#Filtering on 1 Field and 1 value
_1 = df_1.filter(col("Age") < 25)
_1.show(3)
# Filtering on 1 Field and two values
_2 = df_1.filter((col("Age") >=30) & (col("Age") <40))
_2.show(3)
# Filtering on Multiple fields and values
_3 = df_1.filter(
    (col("Age") >= 45) &
    (col("Age") < 60 ) &
    (col("City") != "Medellin")
)
_3.show()

+---------+---+-------+------+--------+-----------------+------------------+
|     Name|Age| Salary|Gender|    City|       New_Salary|          N_Name_1|
+---------+---+-------+------+--------+-----------------+------------------+
|Elizabeth| 23|6000000|     F|  Bogota|6600000.000000001|Elizabeth - Bogota|
|    Grace| 24|6000000|     F|Medellin|6600000.000000001|  Grace - Medellin|
+---------+---+-------+------+--------+-----------------+------------------+

+--------+---+--------+------+------------+--------------------+--------------------+
|    Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|
+--------+---+--------+------+------------+--------------------+--------------------+
|    Sara| 30| 4700000|     F|      Bogota|           5170000.0|       Sara - Bogota|
|Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|
|Santiago| 32|21000000|     M|Barranquilla|2.3100000000000004E7|Santiago - Barran...|
+--------+---+--------+------+------------+--------------------+--------------------+
only showing top 3 rows

+---------+---+-------+------+------------+----------+--------------------+
|     Name|Age| Salary|Gender|        City|New_Salary|            N_Name_1|
+---------+---+-------+------+------------+----------+--------------------+
|    Sonia| 52|4500000|     F|        Cali| 4950000.0|        Sonia - Cali|
|  Matthew| 50|8500000|     M|      Bogota| 9350000.0|    Matthew - Bogota|
|     John| 55|5000000|     M|Barranquilla| 5500000.0| John - Barranquilla|
|  William| 48|8500000|     M|      Bogota| 9350000.0|    William - Bogota|
|     Ryan| 51|9000000|     M|        Cali| 9900000.0|         Ryan - Cali|
|  Gabriel| 47|9500000|     M|        Cali|   1.045E7|      Gabriel - Cali|
|Sebastian| 45|9000000|     M|Barranquilla| 9900000.0|Sebastian - Barra...|
+---------+---+-------+------+------------+----------+--------------------+

<h1> Window Functions </h1>
<h3>Definition</h3>
<p>
is a function which uses values from one or multiple rows to return a value for each row. (This contrasts with an aggregate function, which returns a single value for multiple rows.) Window functions have an OVER clause; any function without an OVER clause is not a window function, but rather an aggregate or single-row (scalar) function
</p>
<h3>Example</h3>
<p>
As an example, here is a query which uses a window function to compare the salary of each employee with the average salary of their department (example from the PostgreSQL documentation)
</p>
<b>SELECT depname, empno, salary, avg(salary) OVER (PARTITION BY depname) FROM empsalary;</b>

| depname   | empno | salary | avg                  |
|-----------|-------|--------|----------------------|
| develop   | 11    | 5200   | 5020.0000000000000000|
| develop   | 7     | 4200   | 5020.0000000000000000|
| develop   | 9     | 4500   | 5020.0000000000000000|
| develop   | 8     | 6000   | 5020.0000000000000000|
| develop   | 10    | 5200   | 5020.0000000000000000|
| personnel | 5     | 3500   | 3700.0000000000000000|
| personnel | 2     | 3900   | 3700.0000000000000000|
| sales     | 3     | 4800   | 4866.6666666666666667|
| sales     | 1     | 5000   | 4866.6666666666666667|
| sales     | 4     | 4800   | 4866.6666666666666667|

In [33]:
from pyspark.sql.window import Window
from pyspark.sql.functions import sum

# Here We're gonna get the cummulative Sum  of salaries as the age goes up
window_spec_age = Window.orderBy(["Age"])
cum_sum_salary_age = df_1.withColumn("CumSum Salary",sum("Salary").over(window_spec_age))
cum_sum_salary_age.show(3)

#Here We have the Comulative sum of salaries as the salaries increase
window_spec_salary = Window.orderBy(["Salary"])
cum_sum_salary_salary =  df_1.select(["Name","Age","Gender","Salary"]).withColumn("Cumsum_Salary", sum("Salary").over(window_spec_salary))
cum_sum_salary_salary.show(3)

+---------+---+-------+------+--------+-----------------+------------------+-------------+
|     Name|Age| Salary|Gender|    City|       New_Salary|          N_Name_1|CumSum Salary|
+---------+---+-------+------+--------+-----------------+------------------+-------------+
|Elizabeth| 23|6000000|     F|  Bogota|6600000.000000001|Elizabeth - Bogota|      6000000|
|    Grace| 24|6000000|     F|Medellin|6600000.000000001|  Grace - Medellin|     12000000|
|Charlotte| 25|7000000|     F|    Cali|7700000.000000001|  Charlotte - Cali|     19000000|
+---------+---+-------+------+--------+-----------------+------------------+-------------+
only showing top 3 rows

+------+---+------+-------+-------------+
|  Name|Age|Gender| Salary|Cumsum_Salary|
+------+---+------+-------+-------------+
|Carmen| 65|     F|1500000|      1500000|
| Jairo| 65|     M|2000000|      3500000|
|Daniel| 31|     M|3000000|      6500000|
+------+---+------+-------+-------------+
only showing top 3 rows

In [43]:
# Let's use the window function rank and dense rank
from pyspark.sql.window import Window
from pyspark.sql.functions import rank, dense_rank, desc, row_number
# Here We are ranking so the person with the highest salary comes on top and the one with least at the bottom
window_spec_4_rank = Window.orderBy(desc("Salary"))
rank_salary_1 = df_1.withColumn("Rank", rank().over(window_spec_4_rank)) 
rank_salary_1.show(10)
# Here We will use dense rank again sorting Z-A -- See the output 
window_spec_4_denserank = Window.orderBy(desc("Salary"))
rank_salary_2 = df_1.withColumn("Dense_Rank", dense_rank().over(window_spec_4_denserank))
rank_salary_2.show(10)
# Here we will use the row_number function so that we don't get repeated ranks
window_spec_row_number = Window.orderBy(desc("Salary"))
rank_salary_3 = df_1.withColumn("Row_Number",row_number().over(window_spec_row_number))
rank_salary_3.show(10)

+--------+---+--------+------+------------+--------------------+--------------------+----+
|    Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|Rank|
+--------+---+--------+------+------------+--------------------+--------------------+----+
|Santiago| 32|21000000|     M|Barranquilla|2.3100000000000004E7|Santiago - Barran...|   1|
|Aljandro| 28|13500000|     M|Barranquilla|1.4850000000000002E7|Aljandro - Barran...|   2|
|Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|   3|
|  Andres| 33|10000000|     M|    Medellin|               1.1E7|   Andres - Medellin|   4|
| Michael| 41| 9500000|     M|Barranquilla|             1.045E7|Michael - Barranq...|   5|
|   Jacob| 49| 9500000|     M|    Medellin|             1.045E7|    Jacob - Medellin|   5|
| Gabriel| 47| 9500000|     M|        Cali|             1.045E7|      Gabriel - Cali|   5|
|   Henry| 52| 9000000|     M|    Medellin|           9900000.0|    Henry - Medellin|   8|
|    Ryan| 51| 9000000|     M|        Cali|           9900000.0|         Ryan - Cali|   8|
|Isabella| 39| 9000000|     F|        Cali|           9900000.0|     Isabella - Cali|   8|
+--------+---+--------+------+------------+--------------------+--------------------+----+
only showing top 10 rows

+--------+---+--------+------+------------+--------------------+--------------------+----------+
|    Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|Dense_Rank|
+--------+---+--------+------+------------+--------------------+--------------------+----------+
|Santiago| 32|21000000|     M|Barranquilla|2.3100000000000004E7|Santiago - Barran...|         1|
|Aljandro| 28|13500000|     M|Barranquilla|1.4850000000000002E7|Aljandro - Barran...|         2|
|Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|         3|
|  Andres| 33|10000000|     M|    Medellin|               1.1E7|   Andres - Medellin|         4|
| Michael| 41| 9500000|     M|Barranquilla|             1.045E7|Michael - Barranq...|         5|
|   Jacob| 49| 9500000|     M|    Medellin|             1.045E7|    Jacob - Medellin|         5|
| Gabriel| 47| 9500000|     M|        Cali|             1.045E7|      Gabriel - Cali|         5|
|   Henry| 52| 9000000|     M|    Medellin|           9900000.0|    Henry - Medellin|         6|
|    Ryan| 51| 9000000|     M|        Cali|           9900000.0|         Ryan - Cali|         6|
|Isabella| 39| 9000000|     F|        Cali|           9900000.0|     Isabella - Cali|         6|
+--------+---+--------+------+------------+--------------------+--------------------+----------+
only showing top 10 rows

+--------+---+--------+------+------------+--------------------+--------------------+----------+
|    Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|Row_Number|
+--------+---+--------+------+------------+--------------------+--------------------+----------+
|Santiago| 32|21000000|     M|Barranquilla|2.3100000000000004E7|Santiago - Barran...|         1|
|Aljandro| 28|13500000|     M|Barranquilla|1.4850000000000002E7|Aljandro - Barran...|         2|
|Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|         3|
|  Andres| 33|10000000|     M|    Medellin|               1.1E7|   Andres - Medellin|         4|
| Michael| 41| 9500000|     M|Barranquilla|             1.045E7|Michael - Barranq...|         5|
|   Jacob| 49| 9500000|     M|    Medellin|             1.045E7|    Jacob - Medellin|         6|
| Gabriel| 47| 9500000|     M|        Cali|             1.045E7|      Gabriel - Cali|         7|
|   Henry| 52| 9000000|     M|    Medellin|           9900000.0|    Henry - Medellin|         8|
|    Ryan| 51| 9000000|     M|        Cali|           9900000.0|         Ryan - Cali|         9|
|Isabella| 39| 9000000|     F|        Cali|           9900000.0|     Isabella - Cali|        10|
+--------+---+--------+------+------------+--------------------+--------------------+----------+
only showing top 10 rows

In [69]:
# Now let's Review Aggregation using window Functions using partitions
from pyspark.sql.window import Window
from pyspark.sql.functions import sum, mean, median, stddev

window_part_1 = Window.partitionBy("City")
window_df_1 = df_1.withColumn(
    "Mean_salary_by_city",
    mean("Salary").over(window_part_1)
    ).withColumn(
        "sttdev_salary_city",
        stddev("Salary").over(window_part_1)
    ).withColumn(
        "Sum_by_city",
        sum(col("Salary")).over(window_part_1)
    )
window_df_1.show(30)
# Great! Now let's see what's the contribution of each salary to the city total
_ = window_df_1.withColumn("Contribution", (col("Salary") /col("Sum_by_city")) * 100 )
_.orderBy("City",desc("Contribution")).show(30)

+---------+---+--------+------+------------+--------------------+--------------------+-------------------+------------------+-----------+
|     Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|Mean_salary_by_city|sttdev_salary_city|Sum_by_city|
+---------+---+--------+------+------------+--------------------+--------------------+-------------------+------------------+-----------+
| Aljandro| 28|13500000|     M|Barranquilla|1.4850000000000002E7|Aljandro - Barran...|  7722222.222222222| 3949021.554996891|  139000000|
| Santiago| 32|21000000|     M|Barranquilla|2.3100000000000004E7|Santiago - Barran...|  7722222.222222222| 3949021.554996891|  139000000|
|    Jacob| 27| 7000000|     M|Barranquilla|   7700000.000000001|Jacob - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
|    Emily| 28| 6000000|     F|Barranquilla|   6600000.000000001|Emily - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
|    David| 35| 4000000|     M|Barranquilla|           4400000.0|David - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
|   Olivia| 26| 5500000|     F|Barranquilla|   6050000.000000001|Olivia - Barranqu...|  7722222.222222222| 3949021.554996891|  139000000|
|     Emma| 33| 7000000|     F|Barranquilla|   7700000.000000001| Emma - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
|     John| 55| 5000000|     M|Barranquilla|           5500000.0| John - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
|      Ava| 30| 6500000|     F|Barranquilla|   7150000.000000001|  Ava - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
|  Michael| 41| 9500000|     M|Barranquilla|             1.045E7|Michael - Barranq...|  7722222.222222222| 3949021.554996891|  139000000|
|   Harper| 29| 6500000|     F|Barranquilla|   7150000.000000001|Harper - Barranqu...|  7722222.222222222| 3949021.554996891|  139000000|
|   Evelyn| 34| 5500000|     F|Barranquilla|   6050000.000000001|Evelyn - Barranqu...|  7722222.222222222| 3949021.554996891|  139000000|
|     Lily| 35| 5500000|     F|Barranquilla|   6050000.000000001| Lily - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
|  Madison| 30| 6500000|     F|Barranquilla|   7150000.000000001|Madison - Barranq...|  7722222.222222222| 3949021.554996891|  139000000|
|    Avery| 26| 5500000|     F|Barranquilla|   6050000.000000001|Avery - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|
| Victoria| 32| 7000000|     F|Barranquilla|   7700000.000000001|Victoria - Barran...|  7722222.222222222| 3949021.554996891|  139000000|
|  Jackson| 44| 8500000|     M|Barranquilla|           9350000.0|Jackson - Barranq...|  7722222.222222222| 3949021.554996891|  139000000|
|Sebastian| 45| 9000000|     M|Barranquilla|           9900000.0|Sebastian - Barra...|  7722222.222222222| 3949021.554996891|  139000000|
|     Sara| 30| 4700000|     F|      Bogota|           5170000.0|       Sara - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
| Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|    Jairo| 65| 2000000|     M|      Bogota|           2200000.0|      Jairo - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|  Matthew| 50| 8500000|     M|      Bogota|           9350000.0|    Matthew - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|   Andrew| 29| 4500000|     M|      Bogota|           4950000.0|     Andrew - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|      Mia| 32| 5500000|     F|      Bogota|   6050000.000000001|        Mia - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|  William| 48| 8500000|     M|      Bogota|           9350000.0|    William - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|Elizabeth| 23| 6000000|     F|      Bogota|   6600000.000000001|  Elizabeth - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|    Chloe| 33| 7000000|     F|      Bogota|   7700000.000000001|      Chloe - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|    Lucas| 40| 7500000|     M|      Bogota|   8250000.000000001|      Lucas - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|   Carter| 39| 8000000|     M|      Bogota|           8800000.0|     Carter - Bogota|  6836363.636363637| 2850358.829085463|   75200000|
|   Carmen| 65| 1500000|     F|        Cali|  1650000.0000000002|       Carmen - Cali|          6850000.0|2427275.5646334565|   68500000|
+---------+---+--------+------+------------+--------------------+--------------------+-------------------+------------------+-----------+
only showing top 30 rows

+---------+---+--------+------+------------+--------------------+--------------------+-------------------+------------------+-----------+------------------+
|     Name|Age|  Salary|Gender|        City|          New_Salary|            N_Name_1|Mean_salary_by_city|sttdev_salary_city|Sum_by_city|      Contribution|
+---------+---+--------+------+------------+--------------------+--------------------+-------------------+------------------+-----------+------------------+
| Santiago| 32|21000000|     M|Barranquilla|2.3100000000000004E7|Santiago - Barran...|  7722222.222222222| 3949021.554996891|  139000000|15.107913669064748|
| Aljandro| 28|13500000|     M|Barranquilla|1.4850000000000002E7|Aljandro - Barran...|  7722222.222222222| 3949021.554996891|  139000000| 9.712230215827338|
|  Michael| 41| 9500000|     M|Barranquilla|             1.045E7|Michael - Barranq...|  7722222.222222222| 3949021.554996891|  139000000|  6.83453237410072|
|Sebastian| 45| 9000000|     M|Barranquilla|           9900000.0|Sebastian - Barra...|  7722222.222222222| 3949021.554996891|  139000000| 6.474820143884892|
|  Jackson| 44| 8500000|     M|Barranquilla|           9350000.0|Jackson - Barranq...|  7722222.222222222| 3949021.554996891|  139000000| 6.115107913669065|
|    Jacob| 27| 7000000|     M|Barranquilla|   7700000.000000001|Jacob - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|5.0359712230215825|
|     Emma| 33| 7000000|     F|Barranquilla|   7700000.000000001| Emma - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|5.0359712230215825|
| Victoria| 32| 7000000|     F|Barranquilla|   7700000.000000001|Victoria - Barran...|  7722222.222222222| 3949021.554996891|  139000000|5.0359712230215825|
|      Ava| 30| 6500000|     F|Barranquilla|   7150000.000000001|  Ava - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000| 4.676258992805756|
|   Harper| 29| 6500000|     F|Barranquilla|   7150000.000000001|Harper - Barranqu...|  7722222.222222222| 3949021.554996891|  139000000| 4.676258992805756|
|  Madison| 30| 6500000|     F|Barranquilla|   7150000.000000001|Madison - Barranq...|  7722222.222222222| 3949021.554996891|  139000000| 4.676258992805756|
|    Emily| 28| 6000000|     F|Barranquilla|   6600000.000000001|Emily - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000| 4.316546762589928|
|   Olivia| 26| 5500000|     F|Barranquilla|   6050000.000000001|Olivia - Barranqu...|  7722222.222222222| 3949021.554996891|  139000000|3.9568345323741005|
|   Evelyn| 34| 5500000|     F|Barranquilla|   6050000.000000001|Evelyn - Barranqu...|  7722222.222222222| 3949021.554996891|  139000000|3.9568345323741005|
|     Lily| 35| 5500000|     F|Barranquilla|   6050000.000000001| Lily - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|3.9568345323741005|
|    Avery| 26| 5500000|     F|Barranquilla|   6050000.000000001|Avery - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000|3.9568345323741005|
|     John| 55| 5000000|     M|Barranquilla|           5500000.0| John - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000| 3.597122302158273|
|    David| 35| 4000000|     M|Barranquilla|           4400000.0|David - Barranquilla|  7722222.222222222| 3949021.554996891|  139000000| 2.877697841726619|
| Mauricio| 35|13000000|     M|      Bogota|1.4300000000000002E7|   Mauricio - Bogota|  6836363.636363637| 2850358.829085463|   75200000|17.287234042553195|
|  Matthew| 50| 8500000|     M|      Bogota|           9350000.0|    Matthew - Bogota|  6836363.636363637| 2850358.829085463|   75200000|11.303191489361703|
|  William| 48| 8500000|     M|      Bogota|           9350000.0|    William - Bogota|  6836363.636363637| 2850358.829085463|   75200000|11.303191489361703|
|   Carter| 39| 8000000|     M|      Bogota|           8800000.0|     Carter - Bogota|  6836363.636363637| 2850358.829085463|   75200000|10.638297872340425|
|    Lucas| 40| 7500000|     M|      Bogota|   8250000.000000001|      Lucas - Bogota|  6836363.636363637| 2850358.829085463|   75200000|  9.97340425531915|
|    Chloe| 33| 7000000|     F|      Bogota|   7700000.000000001|      Chloe - Bogota|  6836363.636363637| 2850358.829085463|   75200000| 9.308510638297872|
|Elizabeth| 23| 6000000|     F|      Bogota|   6600000.000000001|  Elizabeth - Bogota|  6836363.636363637| 2850358.829085463|   75200000|7.9787234042553195|
|      Mia| 32| 5500000|     F|      Bogota|   6050000.000000001|        Mia - Bogota|  6836363.636363637| 2850358.829085463|   75200000|7.3138297872340425|
|     Sara| 30| 4700000|     F|      Bogota|           5170000.0|       Sara - Bogota|  6836363.636363637| 2850358.829085463|   75200000|              6.25|
|   Andrew| 29| 4500000|     M|      Bogota|           4950000.0|     Andrew - Bogota|  6836363.636363637| 2850358.829085463|   75200000|  5.98404255319149|
|    Jairo| 65| 2000000|     M|      Bogota|           2200000.0|      Jairo - Bogota|  6836363.636363637| 2850358.829085463|   75200000|2.6595744680851063|
|  Gabriel| 47| 9500000|     M|        Cali|             1.045E7|      Gabriel - Cali|          6850000.0|2427275.5646334565|   68500000| 13.86861313868613|
+---------+---+--------+------+------------+--------------------+--------------------+-------------------+------------------+-----------+------------------+
only showing top 30 rows

In [5]:
(((30 * 8 ) * 5 ) *4) * 3900

18720000